app/controllers/clientes_controller.rb

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
---
  def show
    @cliente = Cliente.find(params[:id])

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
---
  def edit
    @cliente = Cliente.find(params[:id])

INSERT INTO "clientes" ("endereco", "telefone", "created_at", "dt_nascto", "nome", "cpf", "cep", "updated_at", "foto", "sexo", "rg", "email", "senha") VALUES('Rua Eduardo de Castro Junior, numero 145, bairro Chacara Jafet, Mogi das Cruzes - SP, Brasil', '80656913', '2011-09-21 23:14:05.747411', '2006-04-05 00:00:00.000000', 'Eduardo Montero', '33730622846', '08730830', '2011-09-21 23:14:05.747411', '', 'M', '36880950x', 'edumusic@gmail.com', 'testando') RETURNING "id"
---
  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
UPDATE "clientes" SET "updated_at" = '2011-09-21 23:14:40.398319', "dt_nascto" = '2001-04-05 00:00:00.000000' WHERE "id" = 1
---
  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])

SELECT * FROM "clientes" WHERE ("clientes"."id" = 5)
DELETE FROM "clientes" WHERE "id" = 5
---
  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy

SELECT * FROM "clientes" WHERE ("clientes"."id" = 2)
---
  def inativar_mod
    @cliente = Cliente.find(params[:id])

SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
---
  def ativar_mod
    @cliente = Cliente.find(params[:id])

SELECT * FROM "clientes" WHERE ("clientes"."rg" = '36880950x') LIMIT 1
---
  def buscar
    @cliente = Cliente.find_by_rg(params[:rg])